In [1]:
from cmath import isnan

import pandas as pd

# Basic Pandas Operations
1)  create DataFrames manually.

A Dataframe is basically a table that aloows us tu like work with different document types like csv and organize data in a well mannered way

In [9]:
dataframe=pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,10,11,12]])
print(dataframe)

   0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

You can also name the rows
Index define what names would the row name be, originally they are number starting from 0

In [10]:
dataframe=pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,10,11,12]],index=["A","B","C"])
print(dataframe)

   0   1   2   3
A  1   2   3   4
B  5   6   7   8
C  9  10  11  12

You can also name the coloumns which is more preffered and is done by using the coloumn

In [11]:
dataframe=pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,10,11,12]],columns=["A","B","C","D"])
print(dataframe)

   A   B   C   D
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

2) Import CSV files using pd.read_csv().

In [146]:
dataframe=pd.read_csv("../Files/Assignment2/cars.csv")
dataframe

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4   $4000.00
1   Honda    Red          87899      4   $5000.00
2  Toyota   Blue          32549      3   $7000.00
3     BMW  Black          11179      5  $22000.00
4  Nissan  White         213095      4   $3500.00
5  Toyota  Green          99213      4   $4500.00
6   Honda   Blue          45698      4   $7500.00
7   Honda   Blue          54738      4   $7000.00
8  Toyota  White          60000      4   $6250.00
9  Nissan  White          31600      4   $9700.00

In [173]:
dataframe_coffee=pd.read_csv("../Files/Assignment2/coffee.csv")
dataframe_coffee

    Unnamed: 0        Day Coffee Type  Units Sold
0            0     Monday    Espresso          25
1            1     Monday       Latte          15
2            2    Tuesday    Espresso          30
3            3    Tuesday       Latte          20
4            4  Wednesday    Espresso          35
5            5  Wednesday       Latte          25
6            6   Thursday    Espresso          40
7            7   Thursday       Latte          30
8            8     Friday    Espresso          45
9            9     Friday       Latte          35
10          10   Saturday    Espresso          45
11          11   Saturday       Latte          35
12          12     Sunday    Espresso          45
13          13     Sunday       Latte          35

In [73]:
olympic= pd.read_csv("../Files/Assignment2/olympicData.csv")

3) Export a DataFrame using to_csv().

In [134]:
content.to_csv("../Files/Assignment2/cars.csv")

# Overwrites the file at this path with the changes

# Data Exploration

1) Use .dtypes, .info(), .describe(), .columns, .head(), .tail(), and len()

In [147]:
dataframe.dtypes

Make               str
Colour             str
Odometer (KM)    int64
Doors            int64
Price              str
dtype: object

.info= gives us the info of the datatypes, memory usage and no of unique values of each coloumn

In [148]:
dataframe.info()

<class 'pandas.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     str
 1   Colour         10 non-null     str
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     str
dtypes: int64(2), str(3)
memory usage: 532.0 bytes

.describe= gives us the info of the mean, count minimum value and so on
 of each coloumn

In [149]:
dataframe.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

.columns gives us the columns of our dataframe

In [150]:
dataframe.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='str')

.head(value) gives us top most rows you can specify value or it will return top 5

In [151]:
dataframe.head()

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4   $4000.00
1   Honda    Red          87899      4   $5000.00
2  Toyota   Blue          32549      3   $7000.00
3     BMW  Black          11179      5  $22000.00
4  Nissan  White         213095      4   $3500.00

.tail(value) gives us bottom most rows you can specify value or it will return bottom 5

In [152]:
dataframe.tail(6)

     Make Colour  Odometer (KM)  Doors     Price
4  Nissan  White         213095      4  $3500.00
5  Toyota  Green          99213      4  $4500.00
6   Honda   Blue          45698      4  $7500.00
7   Honda   Blue          54738      4  $7000.00
8  Toyota  White          60000      4  $6250.00
9  Nissan  White          31600      4  $9700.00

.shape gives us the [rows,columns]

In [153]:
dataframe.shape

(10, 5)

.Unique= we can use .unique to find the unique values throughout the table or finding unique values inside a specific coloumn

In [154]:
dataframe.nunique()

Make              4
Colour            5
Odometer (KM)    10
Doors             3
Price             9
dtype: int64

In [155]:
dataframe["Price"].unique()

# works only on numbers

<StringArray>
[ '$4000.00',  '$5000.00',  '$7000.00', '$22000.00',  '$3500.00',  '$4500.00',
  '$7500.00',  '$6250.00',  '$9700.00']
Length: 9, dtype: str

Access rows using .loc[] and .iloc[].

loc=dataframe_name[rows,coloumns]

iloc=dataframe_name[rows,coloumns]

difference= in loc we get by like index name and so on like we can do loc[["A","B"]] but in iloc this will give error and we have to give index like [0,1]

In [156]:
dataframe.loc[[0,1,2],["Doors","Price"]]

# Take rows 1,2,3 and show columns  Doors,Price

   Doors     Price
0      4  $4000.00
1      4  $5000.00
2      3  $7000.00

In [157]:
dataframe.loc[1:5,:]

#spilicing: taking data of from 1 to 5 rows and all coloumns

     Make Colour  Odometer (KM)  Doors      Price
1   Honda    Red          87899      4   $5000.00
2  Toyota   Blue          32549      3   $7000.00
3     BMW  Black          11179      5  $22000.00
4  Nissan  White         213095      4   $3500.00
5  Toyota  Green          99213      4   $4500.00

In [158]:
dataframe.iloc[1:5,[1,2,3]]

  Colour  Odometer (KM)  Doors
1    Red          87899      4
2   Blue          32549      3
3  Black          11179      5
4  White         213095      4

Sort

allows us to sort rows based on a certain column in ascending or descending order

In [60]:
dataframe.sort_values("Price",ascending=True)

#if ascending = false then in descending order , if true then ofcourse in ascending order

    Unnamed: 0        Day Coffee Type  Units Sold
1            1     Monday       Latte          15
3            3    Tuesday       Latte          20
0            0     Monday    Espresso          25
5            5  Wednesday       Latte          25
2            2    Tuesday    Espresso          30
7            7   Thursday       Latte          30
4            4  Wednesday    Espresso          35
9            9     Friday       Latte          35
11          11   Saturday       Latte          35
13          13     Sunday       Latte          35
6            6   Thursday    Espresso          40
8            8     Friday    Espresso          45
10          10   Saturday    Espresso          45
12          12     Sunday    Espresso          45

In [159]:
dataframe.sort_values(["Price","Doors"], ascending=(0,1))

# sort first based on coffee type but if two rows have same coffee type sort by units sold,, 0 in ascending means that for coffee type do not sort by ascending and 1 means that sort by ascending

     Make Colour  Odometer (KM)  Doors      Price
9  Nissan  White          31600      4   $9700.00
6   Honda   Blue          45698      4   $7500.00
2  Toyota   Blue          32549      3   $7000.00
7   Honda   Blue          54738      4   $7000.00
8  Toyota  White          60000      4   $6250.00
1   Honda    Red          87899      4   $5000.00
5  Toyota  Green          99213      4   $4500.00
0  Toyota  White         150043      4   $4000.00
4  Nissan  White         213095      4   $3500.00
3     BMW  Black          11179      5  $22000.00

# Series & Column Operations
series  is basically a one d array that represent a single column

creating a series

series=pd.Series([1,2,3,4,5,6])


mathemtaical functions
| Operation          | How
| ------------------ | ------------
| Sum                | `s.sum()`
| Mean / Average     | `s.mean()`
| Median             | `s.median()`
| Min                | `s.min()`
| Max                | `s.max()`
| Standard Deviation | `s.std()`
| Count (non-NA)     | `s.count()`

conditions
series[series>5]

1) creating a series and Find the mean, sum, etc. of numeric Series

series=pd.Series([1,2,3,4,5,6])

In [160]:
series=pd.Series([2,3,4,5,6,7,8,9])

In [161]:
series.sum()

np.int64(44)

In [162]:
series.mean()

np.float64(5.5)

In [163]:
series=series+2
series

0     4
1     5
2     6
3     7
4     8
5     9
6    10
7    11
dtype: int64

In [164]:
series[series>6]

3     7
4     8
5     9
6    10
7    11
dtype: int64

2) Filter rows based on conditions.

In [168]:

dataframe.loc[(dataframe["Price"].str.replace("$","").astype(float)>5000) & dataframe["Make"].str.contains("Toyota",case=False)].head()

     Make Colour  Odometer (KM)  Doors     Price
2  Toyota   Blue          32549      3  $7000.00
8  Toyota  White          60000      4  $6250.00

3) Create COlumns from exsisting Ones

adding a simple column

In [169]:
dataframe["new_Column"]=4.99
dataframe

# creates a new coloumn and make its value 4.99 for all rows

     Make Colour  Odometer (KM)  Doors      Price  new_Column
0  Toyota  White         150043      4   $4000.00        4.99
1   Honda    Red          87899      4   $5000.00        4.99
2  Toyota   Blue          32549      3   $7000.00        4.99
3     BMW  Black          11179      5  $22000.00        4.99
4  Nissan  White         213095      4   $3500.00        4.99
5  Toyota  Green          99213      4   $4500.00        4.99
6   Honda   Blue          45698      4   $7500.00        4.99
7   Honda   Blue          54738      4   $7000.00        4.99
8  Toyota  White          60000      4   $6250.00        4.99
9  Nissan  White          31600      4   $9700.00        4.99

adding a new coloumn and for each row having seperate values based on condition

if more than two options like here it was espresso and latte but if more

dataframe["new_price"] = np.where(
    dataframe["Coffee Type"] == "Espresso", 3.99,
    np.where(dataframe["Coffee Type"] == "Latte", 4.99, 5.99)
)

In [170]:
import numpy as np
dataframe["Mileage"]= np.where(dataframe["Make"]=="Toyota",3.99,5.99)
dataframe

     Make Colour  Odometer (KM)  Doors      Price  new_Column  Mileage
0  Toyota  White         150043      4   $4000.00        4.99     3.99
1   Honda    Red          87899      4   $5000.00        4.99     5.99
2  Toyota   Blue          32549      3   $7000.00        4.99     3.99
3     BMW  Black          11179      5  $22000.00        4.99     5.99
4  Nissan  White         213095      4   $3500.00        4.99     5.99
5  Toyota  Green          99213      4   $4500.00        4.99     3.99
6   Honda   Blue          45698      4   $7500.00        4.99     5.99
7   Honda   Blue          54738      4   $7000.00        4.99     5.99
8  Toyota  White          60000      4   $6250.00        4.99     3.99
9  Nissan  White          31600      4   $9700.00        4.99     5.99

Removing a coloumns using drop

In [171]:
dataframe=dataframe.drop(columns=["new_Column"])

In [172]:
dataframe

     Make Colour  Odometer (KM)  Doors      Price  Mileage
0  Toyota  White         150043      4   $4000.00     3.99
1   Honda    Red          87899      4   $5000.00     5.99
2  Toyota   Blue          32549      3   $7000.00     3.99
3     BMW  Black          11179      5  $22000.00     5.99
4  Nissan  White         213095      4   $3500.00     5.99
5  Toyota  Green          99213      4   $4500.00     3.99
6   Honda   Blue          45698      4   $7500.00     5.99
7   Honda   Blue          54738      4   $7000.00     5.99
8  Toyota  White          60000      4   $6250.00     3.99
9  Nissan  White          31600      4   $9700.00     5.99

making new coloumn based on some mathematical operations

In [176]:
import numpy as np
dataframe_coffee["new_price"]=np.where(dataframe_coffee["Coffee Type"] == "Espresso", 3.99,4.99)
dataframe_coffee["revenue"]=dataframe_coffee['Units Sold']* dataframe_coffee['new_price']
dataframe_coffee

    Unnamed: 0        Day Coffee Type  Units Sold  new_price  revenue
0            0     Monday    Espresso          25       3.99    99.75
1            1     Monday       Latte          15       4.99    74.85
2            2    Tuesday    Espresso          30       3.99   119.70
3            3    Tuesday       Latte          20       4.99    99.80
4            4  Wednesday    Espresso          35       3.99   139.65
5            5  Wednesday       Latte          25       4.99   124.75
6            6   Thursday    Espresso          40       3.99   159.60
7            7   Thursday       Latte          30       4.99   149.70
8            8     Friday    Espresso          45       3.99   179.55
9            9     Friday       Latte          35       4.99   174.65
10          10   Saturday    Espresso          45       3.99   179.55
11          11   Saturday       Latte          35       4.99   174.65
12          12     Sunday    Espresso          45       3.99   179.55
13          13     Sunday       Latte          35       4.99   174.65

renaming a column

In [178]:
dataframe_coffee=dataframe_coffee.rename(columns={'new_price':'price'})
dataframe_coffee

    Unnamed: 0        Day Coffee Type  Units Sold  price  revenue
0            0     Monday    Espresso          25   3.99    99.75
1            1     Monday       Latte          15   4.99    74.85
2            2    Tuesday    Espresso          30   3.99   119.70
3            3    Tuesday       Latte          20   4.99    99.80
4            4  Wednesday    Espresso          35   3.99   139.65
5            5  Wednesday       Latte          25   4.99   124.75
6            6   Thursday    Espresso          40   3.99   159.60
7            7   Thursday       Latte          30   4.99   149.70
8            8     Friday    Espresso          45   3.99   179.55
9            9     Friday       Latte          35   4.99   174.65
10          10   Saturday    Espresso          45   3.99   179.55
11          11   Saturday       Latte          35   4.99   174.65
12          12     Sunday    Espresso          45   3.99   179.55
13          13     Sunday       Latte          35   4.99   174.65

Making a new column using some string functions
eg here we will make a new column for first name in the olympic data

In [97]:
olympic["firstName"]=olympic["name"].str.split(" ").str[0]
olympic.head(10)

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,firstName
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-Franois
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert
5,6,Nicolas Chatelain,1970-01-13,Amiens,Somme,FRA,France,181.0,70.0,NaN,Nicolas
6,7,Patrick Chila,1969-11-27,Ris-Orangis,Essonne,FRA,France,180.0,73.0,NaN,Patrick
7,8,Henri Cochet,1901-12-14,Villeurbanne,Rhne,FRA,France,NaN,NaN,1987-04-02,Henri
8,9,Marcel Cousin,1896-08-04,Nmes,Gard,FRA,France,NaN,NaN,1986-08-01,Marcel
9,10,Guy de la Chapelle,1868-07-16,Farges-Allichamps,Cher,FRA,France,NaN,NaN,1923-08-27,Guy

converting to a datetimeformat

In [98]:
olympic["birthDateinDateFormat"]= pd.to_datetime(olympic["born_date"])
olympic

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,firstName,birthDateinDateFormat
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-Franois,1886-12-12
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,1969-04-01
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean,1898-08-13
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques,1895-05-11
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,1878-04-17
...,...,...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN,Polina,2002-01-30
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN,Valeriya,1999-09-20
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN,Yuliya,1998-05-08
145498,149225,Andr Foussard,1899-05-19,Niort,Deux-Svres,FRA,France,166.0,NaN,1986-03-18,Andr,1899-05-19
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20,Bill,1913-07-15

making a born year column

In [99]:
olympic["born_year"]=olympic['birthDateinDateFormat'].dt.year
olympic

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,firstName,birthDateinDateFormat,born_year
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-Franois,1886-12-12,1886.0
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,1969-04-01,1969.0
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean,1898-08-13,1898.0
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques,1895-05-11,1895.0
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,1878-04-17,1878.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN,Polina,2002-01-30,2002.0
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN,Valeriya,1999-09-20,1999.0
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN,Yuliya,1998-05-08,1998.0
145498,149225,Andr Foussard,1899-05-19,Niort,Deux-Svres,FRA,France,166.0,NaN,1986-03-18,Andr,1899-05-19,1899.0
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20,Bill,1913-07-15,1913.0

Use of lambda Function

In [100]:
olympic["Height Category"]= olympic['height_cm'].apply(lambda x:'short' if x < 165 else('average' if x<185 else 'Tall'))
olympic

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,firstName,birthDateinDateFormat,born_year,Height Category
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-Franois,1886-12-12,1886.0,Tall
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,1969-04-01,1969.0,average
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean,1898-08-13,1898.0,average
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques,1895-05-11,1895.0,average
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,1878-04-17,1878.0,Tall
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN,Polina,2002-01-30,2002.0,average
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN,Valeriya,1999-09-20,1999.0,average
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN,Yuliya,1998-05-08,1998.0,short
145498,149225,Andr Foussard,1899-05-19,Niort,Deux-Svres,FRA,France,166.0,NaN,1986-03-18,Andr,1899-05-19,1899.0,average
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20,Bill,1913-07-15,1913.0,Tall

# Grouping & Aggregation

1) Use groupby() and mean() on the dataset.

In [186]:
dataframe["Price"]=dataframe["Price"].str.replace("$","").astype(float).astype(int)

dataframe.groupby("Make")["Price"].mean()

Make
BMW       22000.0
Honda      6500.0
Nissan     6600.0
Toyota     5437.5
Name: Price, dtype: float64

In [187]:
dataframe.groupby("Make")["Price"].sum()

Make
BMW       22000
Honda     19500
Nissan    13200
Toyota    21750
Name: Price, dtype: int64

Applying multiple aggregations together

In [190]:
dataframe.groupby("Make")["Price"].agg(["sum","mean","max","min"])

          sum     mean    max    min
Make
BMW     22000  22000.0  22000  22000
Honda   19500   6500.0   7500   5000
Nissan  13200   6600.0   9700   3500
Toyota  21750   5437.5   7000   4000

Grouping by more than 1 column

In [193]:
dataframe.groupby(["Make","Colour"])["Price"].sum()

# hr make ki gaari k dekho kon kon sh color hain and un ka min nikalo

Make    Colour
BMW     Black     22000
Honda   Blue      14500
        Red        5000
Nissan  White     13200
Toyota  Blue       7000
        Green      4500
        White     10250
Name: Price, dtype: int64

2) Create a crosstab using pd.crosstab().

basically allows us to see that for this say make there are these color options so what is the frequency for each in actuality

In [194]:
pd.crosstab(dataframe["Make"],dataframe["Colour"])

Colour  Black  Blue  Green  Red  White
Make
BMW         1     0      0    0      0
Honda       0     2      0    1      0
Nissan      0     0      0    0      2
Toyota      0     1      1    0      2

# Data Cleaning

1) Clean and convert the Price column from string to integer.= Done Already

dataframe["Price"]=dataframe["Price"].str.replace("$","").astype(float).astype(int)

2) Lowercase all values in the Make column.

In [195]:
dataframe["Make"]=dataframe["Make"].str.lower()
dataframe["Make"]

0    toyota
1     honda
2    toyota
3       bmw
4    nissan
5    toyota
6     honda
7     honda
8    toyota
9    nissan
Name: Make, dtype: str

3) Handle missing data

In [203]:
dataframe.loc[[1,2],"Price"]=np.nan
dataframe

     Make Colour  Odometer (KM)  Doors    Price  Mileage
0  toyota  White         150043      4   4000.0     3.99
1   honda    Red          87899      4      NaN     5.99
2  toyota   Blue          32549      3      NaN     3.99
3     bmw  Black          11179      5  22000.0     5.99
4  nissan  White         213095      4   3500.0     5.99
5  toyota  Green          99213      4   4500.0     3.99
6   honda   Blue          45698      4   7500.0     5.99
7   honda   Blue          54738      4   7000.0     5.99
8  toyota  White          60000      4   6250.0     3.99
9  nissan  White          31600      4   9700.0     5.99

filling it a general value using fillna

In [197]:
dataframe["Price"]=dataframe["Price"].fillna(1000)
dataframe

     Make Colour  Odometer (KM)  Doors    Price  Mileage
0  toyota  White         150043      4   4000.0     3.99
1   honda    Red          87899      4   1000.0     5.99
2  toyota   Blue          32549      3   1000.0     3.99
3     bmw  Black          11179      5  22000.0     5.99
4  nissan  White         213095      4   3500.0     5.99
5  toyota  Green          99213      4   4500.0     3.99
6   honda   Blue          45698      4   7500.0     5.99
7   honda   Blue          54738      4   7000.0     5.99
8  toyota  White          60000      4   6250.0     3.99
9  nissan  White          31600      4   9700.0     5.99

fill it mean of that coloumn

In [205]:
dataframe["Price"]=dataframe["Price"].fillna(dataframe["Price"].mean())
dataframe

     Make Colour  Odometer (KM)  Doors     Price  Mileage
0  toyota  White         150043      4   4000.00     3.99
1   honda    Red          87899      4   8056.25     5.99
2  toyota   Blue          32549      3   8056.25     3.99
3     bmw  Black          11179      5  22000.00     5.99
4  nissan  White         213095      4   3500.00     5.99
5  toyota  Green          99213      4   4500.00     3.99
6   honda   Blue          45698      4   7500.00     5.99
7   honda   Blue          54738      4   7000.00     5.99
8  toyota  White          60000      4   6250.00     3.99
9  nissan  White          31600      4   9700.00     5.99

using interpolate such that it finds the like relation uptill that point and does accordingly,, cannot work for firstrow

In [202]:
dataframe["Price"]=dataframe["Price"].interpolate()
dataframe

     Make Colour  Odometer (KM)  Doors    Price  Mileage
0  toyota  White         150043      4   4000.0     3.99
1   honda    Red          87899      4  10000.0     5.99
2  toyota   Blue          32549      3  16000.0     3.99
3     bmw  Black          11179      5  22000.0     5.99
4  nissan  White         213095      4   3500.0     5.99
5  toyota  Green          99213      4   4500.0     3.99
6   honda   Blue          45698      4   7500.0     5.99
7   honda   Blue          54738      4   7000.0     5.99
8  toyota  White          60000      4   6250.0     3.99
9  nissan  White          31600      4   9700.0     5.99

we can also delete if a specific column has nan values

In [204]:
dataframe2=dataframe.copy()
dataframe2.dropna(subset=["Price"], inplace=True)
dataframe2

     Make Colour  Odometer (KM)  Doors    Price  Mileage
0  toyota  White         150043      4   4000.0     3.99
3     bmw  Black          11179      5  22000.0     5.99
4  nissan  White         213095      4   3500.0     5.99
5  toyota  Green          99213      4   4500.0     3.99
6   honda   Blue          45698      4   7500.0     5.99
7   honda   Blue          54738      4   7000.0     5.99
8  toyota  White          60000      4   6250.0     3.99
9  nissan  White          31600      4   9700.0     5.99

Getting rows that have a nan value and dont have an nan value

In [128]:
dataframe[dataframe["Units Sold"].isna()]

   Unnamed: 0      Day Coffee Type  Units Sold
1           1   Monday       Latte         NaN
2           2  Tuesday    Espresso         NaN

In [131]:
dataframe[dataframe["Units Sold"].notna()]

    Unnamed: 0        Day Coffee Type  Units Sold
0            0     Monday    Espresso   25.000000
1            1     Monday       Latte   23.333333
2            2    Tuesday    Espresso   21.666667
3            3    Tuesday       Latte   20.000000
4            4  Wednesday    Espresso   35.000000
5            5  Wednesday       Latte   25.000000
6            6   Thursday    Espresso   40.000000
7            7   Thursday       Latte   30.000000
8            8     Friday    Espresso   45.000000
9            9     Friday       Latte   35.000000
10          10   Saturday    Espresso   45.000000
11          11   Saturday       Latte   35.000000
12          12     Sunday    Espresso   45.000000
13          13     Sunday       Latte   35.000000

# Adding & Modifying Columns

1) Add columns like Seats, Engine Size, Price_per_KM.

In [206]:
dataframe["Seats"]=5
dataframe

     Make Colour  Odometer (KM)  Doors     Price  Mileage  Seats
0  toyota  White         150043      4   4000.00     3.99      5
1   honda    Red          87899      4   8056.25     5.99      5
2  toyota   Blue          32549      3   8056.25     3.99      5
3     bmw  Black          11179      5  22000.00     5.99      5
4  nissan  White         213095      4   3500.00     5.99      5
5  toyota  Green          99213      4   4500.00     3.99      5
6   honda   Blue          45698      4   7500.00     5.99      5
7   honda   Blue          54738      4   7000.00     5.99      5
8  toyota  White          60000      4   6250.00     3.99      5
9  nissan  White          31600      4   9700.00     5.99      5

In [212]:
dataframe["Make"]=dataframe["Make"].str.strip()

In [218]:
dataframe["Engine Size"]= np.where(dataframe["Make"]=="toyota",200,
                                   np.where(dataframe["Make"]=="honda",300,
                                            np.where(dataframe["Make"]=="bmw",400,500)))
dataframe["Engine Size"]

0    200
1    300
2    200
3    400
4    500
5    200
6    300
7    300
8    200
9    500
Name: Engine Size, dtype: int64

In [224]:
dataframe.rename(columns={"Mileage":"Price Per KM"},inplace=True)
dataframe

,Make,Colour,Odometer (KM),Doors,Price,Price Per KM,Seats,Engine Size
0,toyota,White,150043,4,4000.00,3.99,5,200
1,honda,Red,87899,4,8056.25,5.99,5,300
2,toyota,Blue,32549,3,8056.25,3.99,5,200
3,bmw,Black,11179,5,22000.00,5.99,5,400
4,nissan,White,213095,4,3500.00,5.99,5,500
5,toyota,Green,99213,4,4500.00,3.99,5,200
6,honda,Blue,45698,4,7500.00,5.99,5,300
7,honda,Blue,54738,4,7000.00,5.99,5,300
8,toyota,White,60000,4,6250.00,3.99,5,200
9,nissan,White,31600,4,9700.00,5.99,5,500